app/views/home/index.html.erb

                <span class="text-muted">
                  <%= pluralize(post.comments.count, "コメント") %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 3

                  <i class="fas fa-file-alt me-1"></i>
                  <%= pluralize(category.posts.count, "投稿") %>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."category_id" = 1