app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id])
    @posts = @category.posts.includes(:comments).recent.page(params[:page]).per(20)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = 1 ORDER BY "posts"."created_at" DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 1
SELECT COUNT(*) FROM "posts" WHERE "posts"."category_id" = 1