app/controllers/home_controller.rb

  def index
    @categories = Category.all
    @recent_posts = Post.includes(:category).recent.limit(10)
---
SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (3, 2, 1)
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT 10