app/controllers/posts_controller.rb

  def set_category
    @category = Category.find(params[:category_id]) if params[:category_id]
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 3 LIMIT 1