app/views/categories/index.html.erb

SELECT COUNT(*) FROM "posts" WHERE "posts"."category_id" = 1
---
              <i class="fas fa-file-alt me-1"></i>
              <%= pluralize(category.posts.count, "投稿") %>