app/views/categories/show.html.erb

          <span class="text-muted">
            <%= pluralize(@category.posts.count, "投稿") %>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."category_id" = 1

                <span class="text-muted">
                  <%= pluralize(post.comments.count, "コメント") %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 1